[{"_id":{ "$oid": "5ab151428a980e0012fab9d1" },"previous_version":"None","title":"My Omelete","created_at":1521569197158,"version":1,"instructions":["BEAT eggs, water, salt and pepper in small bowl until blended.","HEAT butter in 7 to 10-inch nonstick omelet pan or skillet over medium-high heat until hot. TILT pan to coat bottom. POUR IN egg mixture. Mixture should set immediately at edges.","GENTLY PUSH cooked portions from edges toward the center with inverted turner so that uncooked eggs can reach the hot pan surface. CONTINUE cooking, tilting pan and gently moving cooked portions as needed.","When top surface of eggs is thickened and no visible liquid egg remains, PLACE hame on one side of the omelet. FOLD omelet in half with turner. With a quick flip of the wrist, turn pan and INVERT or SLIDE omelet onto plate. SERVE immediately."],"materials":["2 Eggs","Salt and Pepper to Taste","Cubed Ham (Optional)","2 Tablespoons of water","1 Teaspoon of Butter"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0},{"_id":{ "$oid": "5ab19c558a980e0012fab9d2" },"previous_version":"None","title":"Fluffy Pancakes","created_at":1521569197158,"version":1,"instructions":["Combine milk with vinegar in a medium bowl and set aside for 5 minutes to sour.","Combine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into soured milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.","Heat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side."],"materials":["3/4 cup milk","2 tablespoons white vinegar","1 cup all-purpose flour","1 teaspoon baking powder","1/2 teaspoon baking soda","1 egg","2 tablespoons butter, melted","cooking spray"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0},{"_id":{ "$oid": "5ab19cfd8a980e0012fab9d3" },"previous_version":"None","title":"Baked Ham and Cheese Party Sandwiches","created_at":1521569197158,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.","In a bowl, mix together butter, Dijon mustard, Worcestershire sauce, poppy seeds, and dried onion. Separate the tops from bottoms of the rolls, and place the bottom pieces into the prepared baking dish. Layer about half the ham onto the rolls. Arrange the Swiss cheese over the ham, and top with remaining ham slices in a layer. Place the tops of the rolls onto the sandwiches. Pour the mustard mixture evenly over the rolls.","Bake in the preheated oven until the rolls are lightly browned and the cheese has melted, about 20 minutes. Slice into individual rolls through the ham and cheese layers to serve."],"materials":["3/4 cup melted butter","1 1/2 tablespoons Dijon mustard","1 1/2 teaspoons Worcestershire sauce","1 1/2 tablespoons poppy seeds","1 tablespoon dried minced onion","24 mini sandwich rolls","1 pound thinly sliced cooked deli ham","1 pound thinly sliced Swiss cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0},{"_id":{ "$oid": "5ab19d8a8a980e0012fab9d4" },"previous_version":"None","title":"Peanut Butter Banana Smoothie","created_at":1521569197158,"version":1,"instructions":["Place bananas, milk, peanut butter, honey, and ice cubes in a blender; blend until smooth, about 30 seconds."],"materials":["2 bananas, broken into chunks","2 cups milk","1/2 cup peanut butter","2 tablespoons honey, or to taste","2 cups ice cubes"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0},{"_id":{ "$oid": "5ab19e448a980e0012fab9d5" },"previous_version":"None","title":"Chef John's Banana Bread","created_at":1521569197158,"version":1,"instructions":["Preheat the oven to 325 degrees F (165 degrees C). Coat a 9x4-inch loaf pan with cooking spray.","Whisk flour, salt, baking powder, and baking soda together in a bowl.","Beat butter and sugar with an electric mixer in a large bowl until smooth. Add mashed bananas and beat until combined. Beat eggs into the butter mixture one at a time, fully blending each egg before adding the next. Stir vanilla extract and milk into the mixture.","Stir chopped walnuts, chocolate chips, and flour mixture into banana mixture until just incorporated.","Pour batter into the prepared loaf pan. Tap pan on the counter to release any air pockets.","Bake in preheated oven for about 1 hour 10 minutes, or until an inserted toothpick comes out clean.","Let the bread rest in the pan for 15-20 minutes; remove from pan, slice, and serve."],"materials":["cooking spray","2 cups all-purpose flour","1 teaspoon salt","1 teaspoon baking powder","1 teaspoon baking soda","1/2 cup butter, softened","3 ripe bananas, mashed","1 cup white sugar","2 large eggs","1/4 teaspoon vanilla extract","1 tablespoon milk","1 cup chopped walnuts","1/3 cup semisweet chocolate chips"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0},{"_id":{ "$oid": "5ab1a0f68a980e0012fab9d6" },"previous_version":"None","title":"Breakfast Casserole in a Slow Cooker","created_at":1521569197158,"version":1,"instructions":["Spray the crock of a slow cooker with cooking spray. Spread hash browns to cover the bottom of the slow cooker crock.","Whisk eggs, milk, mustard, salt, and black pepper together in a bowl.","Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Spread sausage over hash browns and spread Cheddar cheese over sausage. Pour egg mixture over cheese.","Cook on Low for 6 to 8 hours."],"materials":["cooking spray","1 (26 ounce) package frozen hash brown potatoes, thawed","12 eggs, beaten","1 cup milk","1 tablespoon ground mustard salt and ground black pepper to taste","1 (16 ounce) package maple-flavored sausage","1 (16 ounce) package shredded Cheddar cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0},{"_id":{ "$oid": "5ab1a1c58a980e0012fab9d7" },"previous_version":"None","title":"Cheesy Amish Breakfast Casserole","created_at":1521569197158,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.","Heat a large skillet over medium-high heat; cook and stir bacon and onion until bacon is evenly browned, about 10 minutes. Drain. Transfer bacon and onion to a large bowl. Stir in potatoes, eggs, Cheddar cheese, cottage cheese, and Swiss cheese. Pour mixture into prepared baking dish.","Bake in preheated oven until eggs are set and cheese is melted, 45 to 50 minutes. Let stand 10 minutes before cutting and serving."],"materials":["1 pound sliced bacon, diced","1 sweet onion, chopped","4 cups frozen shredded hash brown potatoes, thawed","9 eggs, lightly beaten","2 cups shredded Cheddar cheese","1 1/2 cups small curd cottage cheese","1 1/4 cups shredded Swiss cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0},{"_id":{ "$oid": "5ab1a3808a980e0012fab9d8" },"previous_version":"None","title":"French Toast Casserole","created_at":1521569197158,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Lightly butter an 8x8 inch baking pan.","Line bottom of pan with bread cubes. In a large bowl, beat together eggs, milk, 2 tablespoons sugar, salt and vanilla. pour egg mixture over bread. Dot with margarine; let stand for 10 minutes.","Combine remaining 2 tablespoons sugar with 1 teaspoon cinnamon and sprinkle over the top. Bake in preheated oven about 45 to 50 minutes, until top is golden."],"materials":["5 cups bread cubes","4 eggs","1 1/2 cups milk","1/4 cup white sugar, divided","1/4 teaspoon salt","1 teaspoon vanilla extract","1 tablespoon margarine, softened","1 teaspoon ground cinnamon"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0},{"_id":{ "$oid": "5ab1a4028a980e0012fab9d9" },"previous_version":"None","title":"Hash Brown and Egg Casserole","created_at":1521569197158,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart baking dish. Place the hash brown potatoes in the bottom of the baking dish.","Heat a skillet over medium heat and cook and stir the sausage and onion until the sausage is crumbly, evenly browned, and no longer pink; drain. Meanwhile, whisk together the eggs, milk, onion powder, garlic powder, salt, and pepper, and pour over the potatoes. Layer with half the Cheddar cheese, the sausage mixture, and the remaining Cheddar cheese. Cover with aluminum foil.","Bake in the preheated oven for 1 hour. Remove cover; return casserole to the oven and bake until a knife inserted into the center comes out clean, about 10 minutes. Let stand for 5 minutes before serving."],"materials":["1 (2 pound) package frozen hash brown potatoes, thawed","1 pound pork sausage 1 small onion, diced","5 eggs","1/2 cup milk","1/2 teaspoon onion powder","1/8 teaspoon garlic powder","salt and ground black pepper to taste","12 ounces shredded Cheddar cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0},{"_id":{ "$oid": "5ab1a4d78a980e0012fab9da" },"previous_version":"None","title":"Fluffy and Delicious Pancakes","created_at":1521569197158,"version":1,"instructions":["Stir milk and vinegar together in a bowl; set aside to sour for about 5 minutes.","Whisk flour, sugar, baking powder, baking soda, and salt together in a bowl. Whisk egg and butter into sour milk. Pour flour mixture into milk mixture and whisk until batter is smooth. Add cinnamon and vanilla extract to batter; mix well.","Heat a large skillet over medium heat and coat with cooking spray. Drop batter, 1/4 cup per pancake, onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter."],"materials":["3/4 cup milk","2 tablespoons white vinegar","1 cup all-purpose flour","2 tablespoons white sugar","1 teaspoon baking powder","1/2 teaspoon baking soda","1/2 teaspoon salt","1 egg","2 tablespoons butter, melted","1 1/2 teaspoons ground cinnamon, or as desired (optional)","1 teaspoon vanilla extract (optional)","cooking spray"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}]