{"_id":{"$oid":"5ab151428a980e0012fab9d1"},"previous_version":"None","title":"My Omelete","created_at":1.521569197158e+12,"version":1,"instructions":["BEAT eggs, water, salt and pepper in small bowl until blended.","HEAT butter in 7 to 10-inch nonstick omelet pan or skillet over medium-high heat until hot. TILT pan to coat bottom. POUR IN egg mixture. Mixture should set immediately at edges.","GENTLY PUSH cooked portions from edges toward the center with inverted turner so that uncooked eggs can reach the hot pan surface. CONTINUE cooking, tilting pan and gently moving cooked portions as needed.","When top surface of eggs is thickened and no visible liquid egg remains, PLACE hame on one side of the omelet. FOLD omelet in half with turner. With a quick flip of the wrist, turn pan and INVERT or SLIDE omelet onto plate. SERVE immediately."],"materials":["2 Eggs","Salt and Pepper to Taste","Cubed Ham (Optional)","2 Tablespoons of water","1 Teaspoon of Butter"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab19c558a980e0012fab9d2"},"previous_version":"None","title":"Fluffy Pancakes","created_at":1.521569197158e+12,"version":1,"instructions":["Combine milk with vinegar in a medium bowl and set aside for 5 minutes to sour.","Combine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into soured milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.","Heat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side."],"materials":["3/4 cup milk","2 tablespoons white vinegar","1 cup all-purpose flour","1 teaspoon baking powder","1/2 teaspoon baking soda","1 egg","2 tablespoons butter, melted","cooking spray"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab19cfd8a980e0012fab9d3"},"previous_version":"None","title":"Baked Ham and Cheese Party Sandwiches","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.","In a bowl, mix together butter, Dijon mustard, Worcestershire sauce, poppy seeds, and dried onion. Separate the tops from bottoms of the rolls, and place the bottom pieces into the prepared baking dish. Layer about half the ham onto the rolls. Arrange the Swiss cheese over the ham, and top with remaining ham slices in a layer. Place the tops of the rolls onto the sandwiches. Pour the mustard mixture evenly over the rolls.","Bake in the preheated oven until the rolls are lightly browned and the cheese has melted, about 20 minutes. Slice into individual rolls through the ham and cheese layers to serve."],"materials":["3/4 cup melted butter","1 1/2 tablespoons Dijon mustard","1 1/2 teaspoons Worcestershire sauce","1 1/2 tablespoons poppy seeds","1 tablespoon dried minced onion","24 mini sandwich rolls","1 pound thinly sliced cooked deli ham","1 pound thinly sliced Swiss cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab19d8a8a980e0012fab9d4"},"previous_version":"None","title":"Peanut Butter Banana Smoothie","created_at":1.521569197158e+12,"version":1,"instructions":["Place bananas, milk, peanut butter, honey, and ice cubes in a blender; blend until smooth, about 30 seconds."],"materials":["2 bananas, broken into chunks","2 cups milk","1/2 cup peanut butter","2 tablespoons honey, or to taste","2 cups ice cubes"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab19e448a980e0012fab9d5"},"previous_version":"None","title":"Chef John's Banana Bread","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat the oven to 325 degrees F (165 degrees C). Coat a 9x4-inch loaf pan with cooking spray.","Whisk flour, salt, baking powder, and baking soda together in a bowl.","Beat butter and sugar with an electric mixer in a large bowl until smooth. Add mashed bananas and beat until combined. Beat eggs into the butter mixture one at a time, fully blending each egg before adding the next. Stir vanilla extract and milk into the mixture.","Stir chopped walnuts, chocolate chips, and flour mixture into banana mixture until just incorporated.","Pour batter into the prepared loaf pan. Tap pan on the counter to release any air pockets.","Bake in preheated oven for about 1 hour 10 minutes, or until an inserted toothpick comes out clean.","Let the bread rest in the pan for 15-20 minutes; remove from pan, slice, and serve."],"materials":["cooking spray","2 cups all-purpose flour","1 teaspoon salt","1 teaspoon baking powder","1 teaspoon baking soda","1/2 cup butter, softened","3 ripe bananas, mashed","1 cup white sugar","2 large eggs","1/4 teaspoon vanilla extract","1 tablespoon milk","1 cup chopped walnuts","1/3 cup semisweet chocolate chips"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1a0f68a980e0012fab9d6"},"previous_version":"None","title":"Breakfast Casserole in a Slow Cooker","created_at":1.521569197158e+12,"version":1,"instructions":["Spray the crock of a slow cooker with cooking spray. Spread hash browns to cover the bottom of the slow cooker crock.","Whisk eggs, milk, mustard, salt, and black pepper together in a bowl.","Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Spread sausage over hash browns and spread Cheddar cheese over sausage. Pour egg mixture over cheese.","Cook on Low for 6 to 8 hours."],"materials":["cooking spray","1 (26 ounce) package frozen hash brown potatoes, thawed","12 eggs, beaten","1 cup milk","1 tablespoon ground mustard salt and ground black pepper to taste","1 (16 ounce) package maple-flavored sausage","1 (16 ounce) package shredded Cheddar cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1a1c58a980e0012fab9d7"},"previous_version":"None","title":"Cheesy Amish Breakfast Casserole","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.","Heat a large skillet over medium-high heat; cook and stir bacon and onion until bacon is evenly browned, about 10 minutes. Drain. Transfer bacon and onion to a large bowl. Stir in potatoes, eggs, Cheddar cheese, cottage cheese, and Swiss cheese. Pour mixture into prepared baking dish.","Bake in preheated oven until eggs are set and cheese is melted, 45 to 50 minutes. Let stand 10 minutes before cutting and serving."],"materials":["1 pound sliced bacon, diced","1 sweet onion, chopped","4 cups frozen shredded hash brown potatoes, thawed","9 eggs, lightly beaten","2 cups shredded Cheddar cheese","1 1/2 cups small curd cottage cheese","1 1/4 cups shredded Swiss cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1a3808a980e0012fab9d8"},"previous_version":"None","title":"French Toast Casserole","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Lightly butter an 8x8 inch baking pan.","Line bottom of pan with bread cubes. In a large bowl, beat together eggs, milk, 2 tablespoons sugar, salt and vanilla. pour egg mixture over bread. Dot with margarine; let stand for 10 minutes.","Combine remaining 2 tablespoons sugar with 1 teaspoon cinnamon and sprinkle over the top. Bake in preheated oven about 45 to 50 minutes, until top is golden."],"materials":["5 cups bread cubes","4 eggs","1 1/2 cups milk","1/4 cup white sugar, divided","1/4 teaspoon salt","1 teaspoon vanilla extract","1 tablespoon margarine, softened","1 teaspoon ground cinnamon"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1a4028a980e0012fab9d9"},"previous_version":"None","title":"Hash Brown and Egg Casserole","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart baking dish. Place the hash brown potatoes in the bottom of the baking dish.","Heat a skillet over medium heat and cook and stir the sausage and onion until the sausage is crumbly, evenly browned, and no longer pink; drain. Meanwhile, whisk together the eggs, milk, onion powder, garlic powder, salt, and pepper, and pour over the potatoes. Layer with half the Cheddar cheese, the sausage mixture, and the remaining Cheddar cheese. Cover with aluminum foil.","Bake in the preheated oven for 1 hour. Remove cover; return casserole to the oven and bake until a knife inserted into the center comes out clean, about 10 minutes. Let stand for 5 minutes before serving."],"materials":["1 (2 pound) package frozen hash brown potatoes, thawed","1 pound pork sausage 1 small onion, diced","5 eggs","1/2 cup milk","1/2 teaspoon onion powder","1/8 teaspoon garlic powder","salt and ground black pepper to taste","12 ounces shredded Cheddar cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1a4d78a980e0012fab9da"},"previous_version":"None","title":"Fluffy and Delicious Pancakes","created_at":1.521569197158e+12,"version":1,"instructions":["Stir milk and vinegar together in a bowl; set aside to sour for about 5 minutes.","Whisk flour, sugar, baking powder, baking soda, and salt together in a bowl. Whisk egg and butter into sour milk. Pour flour mixture into milk mixture and whisk until batter is smooth. Add cinnamon and vanilla extract to batter; mix well.","Heat a large skillet over medium heat and coat with cooking spray. Drop batter, 1/4 cup per pancake, onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter."],"materials":["3/4 cup milk","2 tablespoons white vinegar","1 cup all-purpose flour","2 tablespoons white sugar","1 teaspoon baking powder","1/2 teaspoon baking soda","1/2 teaspoon salt","1 egg","2 tablespoons butter, melted","1 1/2 teaspoons ground cinnamon, or as desired (optional)","1 teaspoon vanilla extract (optional)","cooking spray"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1a5708a980e0012fab9db"},"previous_version":"None","title":"Old-Fashioned Pancakes","created_at":1.521569197158e+12,"version":1,"instructions":["Sift together flour, baking powder, salt, and sugar in a large bowl.","Whisk in melted butter, egg, and milk until combined. Let batter rest for 5 minutes.","Preheat a large skillet over medium-high heat. Spray with cooking spray. Pour batter into the hot skillet, about 1/4 cup of batter for each pancake. Cook for 2 to 3 minutes, until bubbles appear on the sides and center of each pancake. Flip and cook until golden, about 1 to 2 minutes."],"materials":["1 1/2 cups all-purpose flour","3 1/2 teaspoons baking powder","1 teaspoon salt","1 tablespoon white sugar","3 tablespoons butter, melted","1 egg","1 1/4 cups milk","cooking spray"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1a64e8a980e0012fab9dc"},"previous_version":"None","title":"Easy Buttermilk Baking Sheet Pancakes","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 425 degrees F (220 degrees C). Cover an 11x17-inch baking pan with aluminum foil; grease with cooking spray.","Stir buttermilk pancake mix and water together in a bowl. Let batter stand, about 10 minutes.","Pour batter into the prepared pan, spreading to the corners. Scatter chocolate chips, bananas, strawberries, and blueberries on top.","Bake in the preheated oven until pale and set, about 12 minutes. Remove from oven.","Set oven rack about 6 inches from the heat source and preheat the oven's broiler.","Broil pancake until browned, 1 to 2 minutes. Cool for 2 minutes. Slice with a pizza cutter or cookie cutters."],"materials":["cooking spray","3 1/2 cups complete buttermilk pancake mix","2 cups water","1/2 cup mini chocolate chips (optional)","1/3 cup sliced bananas (optional)","1/3 cup sliced fresh strawberries (optional)","1/3 cup fresh blueberries (optional)"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1a8618a980e0012fab9dd"},"previous_version":"None","title":"Chakchouka (Shakshouka)","created_at":1.521569197158e+12,"version":1,"instructions":["Heat the olive oil in a skillet over medium heat. Stir in the onion, bell peppers, and garlic; cook and stir until the vegetables have softened and the onion has turned translucent, about 5 minutes.","Combine the tomatoes, cumin, paprika, salt, and chile pepper into a bowl and mix briefly. Pour the tomato mixture into the skillet, and stir to combine.","Simmer, uncovered, until the tomato juices have cooked off, about 10 minutes. Make four indentations in the tomato mixture for the eggs. Crack the eggs into the indentations. Cover the skillet and let the eggs cook until they're firm but not dry, about 5 minutes."],"materials":["3 tablespoons olive oil","1 1/3 cups chopped onion","1 cup thinly sliced bell peppers, any color","2 cloves garlic, minced, or to taste","2 1/2 cups chopped tomatoes","1 teaspoon ground cumin","1 teaspoon paprika","1 teaspoon salt","1 hot chile pepper, seeded and finely chopped, or to taste","4 eggs"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1aa2c8a980e0012fab9de"},"previous_version":"None","title":"Quick Quiche","created_at":1.521569197158e+12,"version":1,"instructions":["Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.","Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch pie pan.","Line bottom of pie plate with cheese and crumbled bacon. Combine eggs, butter, onion, salt, flour and milk; whisk together until smooth; pour into pie pan.","Bake in preheated oven for 35 minutes, until set. Serve hot or cold."],"materials":["8 slices bacon","4 ounces shredded Swiss cheese","2 tablespoons butter, melted","4 eggs, beaten","1/4 cup finely chopped onion","1 teaspoon salt","1/2 cup all-purpose flour","1 1/2 cups milk"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1aaf68a980e0012fab9df"},"previous_version":"None","title":"Parmalet (Crisp Parmesan Omelet)","created_at":1.521569197158e+12,"version":1,"instructions":["Crack eggs into a mixing bowl. Add 1/4 teaspoon water. Whisk together until just beaten (do not overmix).","Drizzle olive oil into 8-inch nonstick skillet. Brush evenly over the bottom of the pan. Evenly grate cheese into the skillet approximately 1/2-inch deep (or just shy of 1 ounce).","Place pan over medium-high heat. Cheese will slowly start to melt. When cheese starts to bubble and turn golden brown, about 4 minutes, pour eggs evenly over cheese. Reduce heat to low. Sprinkle with salt, pepper, and cayenne. Cover and let eggs cook on low until they are set, checking after the first 30 seconds. For 2 eggs, this should take about 1 minute, total cooking time. Remove pan from heat. Carefully use a spatula to fold parmalet in half. Transfer to serving plate."],"materials":["2 eggs","1/4 teaspoon water","1 teaspoon olive oil","8-inch non-stick skillet","1 ounce freshly grated Parmigiano-Reggiano cheese, or a little less","kosher salt and freshly ground black pepper to taste","1 pinch cayenne pepper"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1ace38a980e0012fab9e0"},"previous_version":"None","title":"Creamy Cottage Cheese Scrambled Eggs","created_at":1.521569197158e+12,"version":1,"instructions":["Melt butter in a skillet over medium heat. Pour beaten eggs into the skillet; let cook undisturbed until the bottom of the eggs begin to firm, 1 to 2 minutes.","Stir cottage cheese and chives into eggs and season with black pepper. Cook and stir until eggs are nearly set, 3 to 4 minutes more."],"materials":["1 tablespoon butter","4 eggs, beaten","1/4 cup cottage cheese","ground black pepper to taste","1 teaspoon chopped fresh chives, or to taste (optional)"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1adaa8a980e0012fab9e1"},"previous_version":"None","title":"Creamy Ham and Cheese Quiche","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 400 degrees F (200 degrees C).","Press pie pasty into the bottom of a 9-inch pie plate.","Bake pie crust in preheated oven for 5 minutes, use a fork to poke holes into the crust, and continue cooking until lightly browned, about 5 minutes more.","Reduce oven heat to 350 degrees F (175 degrees C).","Mix 1/2 cup Cheddar cheese, Swiss cheese, and 1 tablespoon flour in a bowl; spread over the warm pie crust.","Stir ham and honey mustard together in a bowl to coat the ham completely; spoon over the cheese mixture.","Mix half-and-half, eggs, green onions, 1 tablespoon flour, and salt together in bowl. Pour mixture carefully over the ham layer; top with remaining Cheddar cheese.","Bake in preheated oven until set in the center, 40 to 50 minutes. Cool for 10 minutes before cutting."],"materials":["1 (9 inch) pastry for a 9-inch pie crust","1 cup shredded Cheddar cheese, divided","1/2 cup shredded Swiss cheese","2 tablespoons all-purpose flour, divided","1/2 cup diced cooked ham","2 tablespoons honey mustard","1 1/4 cups half-and-half 5 eggs, beaten","1/4 cup green onions","1/4 teaspoon salt"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1ae7a8a980e0012fab9e2"},"previous_version":"None","title":"Clark's Quiche","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 375 degrees F (190 degrees C). Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside. Cook spinach according to package instructions. Allow to cool, then squeeze dry.","Heat olive oil in skillet over medium heat. Saute onions until soft and translucent. Stir in mushrooms, and cook for 2 minutes, or until soft. Stir in ham and cooked bacon. Remove from heat.","In a large bowl, combine spinach, sour cream, salt and pepper. Divide, and spread into pie crusts. Layer with bacon mixture. Mix together Monterey Jack, Cheddar and Parmesan, and sprinkle over pies. Whisk together eggs, half-and-half and parsley. Season with salt and pepper, and pour over pies.","Place pies on baking sheet, and bake on middle shelf in preheated oven for 40 minutes. The top will be puffed and golden brown. Remove from oven, and let stand for 5 to 10 minutes."],"materials":["1/2 pound thick sliced bacon","1 (10 ounce) package frozen chopped spinach, thawed","1 (8 ounce) container sour cream","salt and pepper to taste","2 (9 inch) unbaked pie crusts","2 tablespoons olive oil","1 onion, finely diced","1/2 pound fresh mushrooms, finely diced","2 cups finely diced smoked ham","8 ounces Monterey Jack cheese, shredded","8 ounces Cheddar cheese, shredded","4 ounces Parmesan cheese, grated","8 eggs","1 1/2 cups half-and-half cream","1 tablespoon dried parsley"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1af168a980e0012fab9e3"},"previous_version":"None","title":"Easy Bacon and Cheese Quiche","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 400 degrees F (200 degrees C).","In a medium bowl, mix the bacon, onions, and both cheeses. Place this mixture in the unthawed pie crust.","Mix the eggs and half and half in a bowl. Pour the egg mixture over the cheese mixture.","Bake in preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C) and bake for an additional 35 minutes, until top of quiche begins to turn brown."],"materials":["1 (3 ounce) can bacon bits","1/2 cup chopped onion","5 ounces shredded Swiss cheese","3 ounces grated Parmesan cheese","1 (9 inch) deep dish frozen pie crust","4 eggs, lightly beaten","1 cup half-and-half cream"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1afe38a980e0012fab9e4"},"previous_version":"None","title":"Nutella-Stuffed French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Spread 1 tablespoon chocolate-hazelnut spread onto one side of each of 2 slices cinnamon bread; top each with another bread slice to make 2 sandwiches.","Beat milk, egg, and vanilla extract together in a shallow bowl until smooth. Soak each sandwich in the milk mixture until the bread is moistened, about 15 seconds per side.","Prepare a nonstick pan with cooking spray and heat over medium-high heat.","Cook sandwiches in the hot pan until browned on the bottom, about 2 minutes. Flip sandwiches and continue cooking until other side is browned, about 1 minute more."],"materials":["2 tablespoons chocolate-hazelnut spread (such as Nutella), or more to taste","4 slices cinnamon bread (such as Pepperidge Farm)\",\"1/4 cup milk","1 large egg, beaten","1/4 teaspoon vanilla extract","cooking spray"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1b16d8a980e0012fab9e5"},"previous_version":"None","title":"Strawberry Cheesecake French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat an oven to 100 degrees F ( 40 degrees C).","Heat mashed strawberries and 1/2 cup white sugar in a saucepan over medium heat.","Mix cornstarch and water together in a bowl, then stir into the strawberries.","Cook and stir until thickened, about 5 minutes. Reduce heat to low and simmer while preparing remaining ingredients, stirring occasionally.","Whisk together the milk and eggs in a bowl; set aside.","Mash cream cheese, vanilla extract, and 3/4 cup white sugar in a bowl until smooth.","Spread the cream cheese mixture over a triangle-shaped piece of bread, and top with another piece. Repeat with remaining bread and cream cheese mixture to make 8 triangle-shaped sandwiches.","Heat butter in a large skillet over medium heat.","Dip the sandwiches into the egg mixture, 2 or 3 at a time, and place in the skillet.","Cook until golden brown on both sides, about 3 minutes per side.","Transfer pan-fried sandwiches to a baking sheet and place in the preheated oven to keep warm while cooking remaining sandwiches.","To serve, top French toast with warm strawberry glaze and sliced fresh strawberries and sprinkle with confectioners sugar. Serve with a dollop of whipped cream."],"materials":["1 cup mashed fresh strawberries","1/2 cup white sugar","2 tablespoons cornstarch","1 cup water","1 cup milk","6 eggs","1 (8 ounce) package cream cheese, softened","1 teaspoon vanilla extract","3/4 cup white sugar","8 slices bread, cut in half diagonally","1 teaspoon butter","8 sliced fresh strawberries","1 tablespoon confectioners sugar for dusting","1 cup whipped cream"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1b4248a980e0012fab9e6"},"previous_version":"None","title":"Chef John's French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 400 degrees F (200 degrees C).","Whisk eggs, milk, vanilla extract, cinnamon, allspice, and salt together in a large bowl. Place bread slices in egg mixture and soak, turning to coat, until bread is completely saturated.","Melt butter in a cast-iron skillet over medium heat. Working in batches, cook bread in hot butter until golden, about 3 minutes per side. Transfer toasted bread to a baking sheet.","Bake toast in the oven until outside is crisp and slightly puffed, 12 to 15 minutes."],"materials":["2 eggs","1/2 cup milk","1 teaspoon vanilla extract","1/2 teaspoon ground cinnamon","1/4 teaspoon ground allspice","1 pinch salt","6 (1 inch thick) slices French bread","1 tablespoon butter, or as needed"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1b5488a980e0012fab9e7"},"previous_version":"None","title":"Peanut Butter French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Whisk together milk, eggs, peanut butter, sugar, vanilla extract, and cinnamon in a large bowl.","Heat the oil in a griddle or frying pan over medium heat.","Dunk each slice of bread in egg mixture, soaking both sides. Place in pan, and cook on both sides until golden, about 3 to 4 minutes per side. Serve hot."],"materials":["1/2 cup milk","3 eggs","1/4 cup peanut butter","2 tablespoons white sugar","1/2 teaspoon vanilla extract (optional)","1/4 teaspoon ground cinnamon","1 tablespoon vegetable oil","4 slices bread"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1b64d8a980e0012fab9e8"},"previous_version":"None","title":"Fluffy French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Measure flour into a large mixing bowl. Slowly whisk in the milk. Whisk in the salt, eggs, cinnamon, vanilla extract and sugar until smooth.","Heat a lightly oiled griddle or frying pan over medium heat.","Soak bread slices in mixture until saturated. Cook bread on each side until golden brown. Serve hot."],"materials":["1/4 cup all-purpose flour","1 cup milk","1 pinch salt","3 eggs","1/2 teaspoon ground cinnamon","1 teaspoon vanilla extract","1 tablespoon white sugar","12 thick slices bread"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1b6ee8a980e0012fab9e9"},"previous_version":"None","title":"Best Brioche French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C).","Whisk milk, eggs, vanilla extract, sugar, nutmeg, and salt together in a bowl.","Heat 1 1/2 teaspoons butter in a skillet over medium heat. Working in batches, dip each slice of brioche bread in the egg mixture and cook in the hot butter until golden, 2 to 3 minutes per side, adding more butter as needed. Transfer French toast to a baking sheet.","Bake in the preheated oven until puffed, 8 to 10 minutes.","Cook and stir 1/4 cup butter in a skillet over medium-low heat until browned and toasty, 3 to 5 minutes. Transfer browned butter to a cold dish. Drizzle browned butter over baked French toast and top each slice with 1 tablespoon maple syrup."],"materials":["1 1/2 cups milk","4 eggs","1 teaspoon vanilla extract","1 teaspoon white sugar","1/2 teaspoon ground nutmeg","1 pinch salt","1 tablespoon butter, divided, or more as needed","6 (1 inch) thick slices dry brioche bread","1/4 cup butter","6 tablespoons maple syrup, or more to taste"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1b73d8a980e0012fab9ea"},"previous_version":"None","title":"Eggless French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Whisk milk, cinnamon, and vanilla extract together in a shallow bowl.","Press each slice of bread lightly into the milk mixture to coat both sides, removing it before it gets soaked.","Melt butter in a skillet over medium heat. Cook coated slices in batches until golden brown and somewhat firm, 5 to 8 minutes per side."],"materials":["1 cup milk","2 teaspoons ground cinnamon","1 teaspoon vanilla extract","4 slices white bread","1 teaspoon butter"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1b8a78a980e0012fab9eb"},"previous_version":"None","title":"Haitian French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Cut loaf ends off and reserve for another use. Cut remaining loaf into 1 1/2 inch slices; let stand 4 hours or overnight.","In a 9x13 inch baking pan, combine orange juice, cream, eggs ground cinnamon and white sugar. Place bread slices in pan and turn until liquid is absorbed, about 5 minutes.","In a large skillet, melt butter over medium heat. Add bread slices and cook until browned on both sides, about 5 minutes. Dust generously with confectioners sugar and serve warm."],"materials":["1 French baguette","1 cup orange juice","1/2 cup heavy whipping cream","2 eggs","1 teaspoon ground cinnamon","1/4 cup white sugar","1 dash ground nutmeg","3 tablespoons butter","2 tablespoons confectioners sugar for dusting"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1b9868a980e0012fab9ec"},"previous_version":"None","title":"French Toast I","created_at":1.521569197158e+12,"version":1,"instructions":["Beat together egg, milk, salt, desired spices and vanilla.","Heat a lightly oiled griddle or skillet over medium-high heat.","Dunk each slice of bread in egg mixture, soaking both sides. Place in pan, and cook on both sides until golden. Serve hot."],"materials":["6 thick slices bread","2 eggs","2/3 cup milk","1/4 teaspoon ground cinnamon (optional)","1/4 teaspoon ground nutmeg (optional)","1 teaspoon vanilla extract (optional)","salt to taste"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1ba2b8a980e0012fab9ed"},"previous_version":"None","title":"French Toast II","created_at":1.521569197158e+12,"version":1,"instructions":["In a large mixing bowl, beat the eggs. Add the milk, brown sugar and nutmeg; stir well to combine.","Soak bread slices in the egg mixture until saturated.","Heat a lightly oiled griddle or frying pan over medium high heat. Brown slices on both sides, sprinkle with cinnamon and serve hot"],"materials":["4 eggs","3/4 cup milk","3 tablespoons brown sugar","1 teaspoon ground nutmeg","12 slices white bread","1 tablespoon ground cinnamon"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1ba9a8a980e0012fab9ee"},"previous_version":"None","title":"Grandma's Peach French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["In a saucepan, stir together the brown sugar, butter and water. Bring to a boil, then reduce heat to low, and simmer for 10 minutes, stirring frequently.","Pour the brown sugar mixture into a 9x13 inch baking dish, and tilt the dish to cover the entire bottom. Place peaches in a layer over the sugar coating, then top with slices of French bread. In a medium bowl, whisk together the eggs and vanilla. Slowly pour over the bread slices to coat evenly. Sprinkle cinnamon over the top. Cover and refrigerate for 8 hours or overnight.","Remove the dish from the refrigerator about 30 minutes before baking to come to room temperature. Preheat the oven to 350 degrees F (175 degrees C).","Bake for 25 to 30 minutes in the preheated oven, or until the bread is golden brown. Spoon out portions to serve."],"materials":["1 cup packed brown sugar","1/2 cup butter","2 tablespoons water","1 (29 ounce) can sliced peaches, drained","12 (3/4 inch thick) slices day-old French bread","5 eggs","1 tablespoon vanilla extract","1 pinch ground cinnamon, or to taste"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1bb5a8a980e0012fab9ef"},"previous_version":"None","title":"French Toast Souffle","created_at":1.521569197158e+12,"version":1,"instructions":["Place bread cubes in a lightly greased 9x13 inch baking pan.","In a large bowl, beat cream cheese with an electric mixer at medium speed until smooth. Add eggs one at a time, mixing well after each addition. Stir in milk, half and half, maple syrup, and vanilla until mixture is smooth. Pour cream cheese mixture over the bread; cover, and refrigerate overnight.","The next morning, remove souffle from refrigerator, and let stand at room temperature for 30 minutes. Meanwhile, preheat oven to 375 degrees F (190 degrees C).","Bake, uncovered, for 30 minutes in the preheated oven, or until a knife inserted in the center comes out clean. Sprinkle with confectioners sugar, and serve warm."],"materials":["10 cups white bread cubes","1 (8 ounce) package lowfat cream cheese, softened","8 eggs","1 1/2 cups milk","2/3 cup half-and-half cream\",\"1/2 cup maple syrup","1/2 teaspoon vanilla extract","2 tablespoons confectioners sugar"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1bbfb8a980e0012fab9f0"},"previous_version":"None","title":"Overnight Apple Cinnamon French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Grease a 9x13 inch baking pan. In a small bowl, stir together the melted butter, brown sugar and cinnamon.","Spread the sugar mixture into the bottom of the prepared pan. Spread the apple pie filling evenly over the sugar mixture. Layer the bread slices on top of the filling, pressing down as you go. In a medium bowl, beat the eggs with the milk and vanilla. Slowly pour this mixture over the bread, making sure that it is completely absorbed. Cover the pan with aluminum foil and refrigerate overnight.","In the morning, preheat oven to 350 degrees F (175 degrees C).","Place covered pan into the oven and bake at 350 degrees F (175 degrees C) for 60 to 75 minutes. When done remove from oven and turn on broiler. Remove foil and drizzle maple syrup on top of the egg topping; broil for 2 minutes, or until the syrup begins to caramelize. Remove from the oven and let stand for 10 minutes, then cut into squares. Invert the pan onto a serving tray or baking sheet so the apple filling is on top. Serve hot."],"materials":["3/4 cup butter, melted","1 cup brown sugar","1 teaspoon ground cinnamon","2 (21 ounce) cans apple pie filling","20 slices white bread","6 eggs","1 1/2 cups milk","1 teaspoon vanilla extract","1/2 cup maple syrup"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1bca78a980e0012fab9f1"},"previous_version":"None","title":"Overnight French Toast II","created_at":1.521569197158e+12,"version":1,"instructions":["Combine the corn syrup , butter, and brown sugar in a small saucepan and simmer until the sugar has melted. Pour this mixture over the bottom of a greased 9x13 inch casserole dish.","Place the bread slices over the sugar-butter mixture in the dish. In a bowl, beat together the eggs, milk, vanilla, and salt; pour this mixture over the bread. Cover the dish and let it stand in the refrigerator overnight.","The next morning, preheat oven to 350 degrees F (175 degrees C).","Uncover the pan and bake for 45 minutes. Serve while hot or warm or the French toast will harden in the pan. It can be reheated."],"materials":["2 tablespoons corn syrup","1/2 cup butter","1 cup packed brown sugar","1 (1 pound) loaf French bread, sliced","5 eggs","1 1/2 cups milk","1/4 teaspoon salt"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1bd088a980e0012fab9f2"},"previous_version":"None","title":"Easy French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Beat together egg, milk, cinnamon, vanilla and salt.","Heat a lightly oiled skillet or griddle over medium heat.","Soak bread slices in egg mixture for 20 second on each side, or until thoroughly coated. Cook bread until both sides are lightly browned and crisp. Serve hot."],"materials":["1 egg","3/4 cup milk","1 tablespoon ground cinnamon","1 teaspoon vanilla extract","1 pinch salt","2 slices bread"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1bd5a8a980e0012fab9f3"},"previous_version":"None","title":"Ultimate French Toast","created_at":1.521569197158e+12,"version":1,"instructions":["Combine eggs, milk and cinnamon; beat well. Dip bread into egg mixture until completely coated.","Heat a lightly oiled griddle or frying pan over medium high heat. Cook bread slices until they are golden brown on both sides. Serve hot."],"materials":["4 eggs","2 tablespoons milk","1/4 teaspoon ground cinnamon","8 slices bread"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1be068a980e0012fab9f4"},"previous_version":"None","title":"French Toast Stars","created_at":1.521569197158e+12,"version":1,"instructions":["lace a slice of bread on a cutting board. Align a star-shaped cookie cutter in the center of the slice. Push the cookie cutter through the bread, rocking it gently back and forth. Once the cookie cutter makes it all the way through bread, remove bread outside the cutter. Hold the cutter down on the bread during this step to prevent the star from tearing. Use a sharp knife to trim any bread that lingers outside the cookie cutter. Gently remove the star from the cutter and put aside. Repeat on all slices of bread.","In a medium bowl, beat together eggs, whipping cream, honey, salt, cinnamon, orange zest and vanilla extract.","In a griddle or frying pan, melt the butter over medium high heat.","Dip both sides of the stars in the egg mixture and carefully transfer to the hot griddle. Brown on both sides and transfer to a warm plate while remaining stars cook. Serve hot."],"materials":["8 thick slices white bread","2 eggs","1/4 cup heavy cream","2 tablespoons honey","1/4 teaspoon salt","1/4 teaspoon ground cinnamon","1 tablespoon grated orange zest","1/2 teaspoon vanilla extract","3 tablespoons butter"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1be5b8a980e0012fab9f5"},"previous_version":"None","title":"French Toast Corners","created_at":1.521569197158e+12,"version":1,"instructions":["Cut each slice of bread twice diagonally to make each slice into 4 triangles.","Beat together eggs, milk, vanilla and cinnamon. Dip the bread slices into egg mixture.","Heat butter over medium-high heat in a frying pan or skillet. Cook bread until golden brown. Serve warm with your favorite topping."],"materials":["6 slices white bread","2 eggs","2/3 cup milk","1 teaspoon vanilla extract","1/2 teaspoon ground cinnamon","1 tablespoon butter"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1beb68a980e0012fab9f6"},"previous_version":"None","title":"French Toast Waffles","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat waffle iron. In a large mixing bowl, combine waffle mix, sugar and cinnamon. Stir in milk, eggs and vanilla extract. ","Spray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown. Serve hot."],"materials":["1 cup pancake/waffle mix","2 teaspoons white sugar","1 teaspoon ground cinnamon","1/2 cup cold milk","2 eggs","1 teaspoon vanilla extract"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1bf208a980e0012fab9f7"},"previous_version":"None","title":"Waffles I","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat waffle iron. Beat eggs in large bowl with hand beater until fluffy. Beat in flour, milk, vegetable oil, sugar, baking powder, salt and vanilla, just until smooth.","Spray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown. Serve hot."],"materials":["2 eggs","2 cups all-purpose flour","1 3/4 cups milk","1/2 cup vegetable oil","1 tablespoon white sugar","4 teaspoons baking powder","1/4 teaspoon salt","1/2 teaspoon vanilla extract"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1bff48a980e0012fab9f8"},"previous_version":"None","title":"Tender and Easy Buttermilk Waffles","created_at":1.521569197158e+12,"version":1,"instructions":["Whisk flour, sugar, baking powder, baking soda, and salt together in a bowl until evenly combined. Whisk buttermilk and butter together in a separate bowl; add eggs. Stir buttermilk mixture into flour mixture until just combined and batter is slightly lumpy; add vanilla extract.","Preheat a waffle iron according to manufacturer's instructions.","Pour enough batter into the preheated waffle iron to reach 1/2 inch from the edge. Cook according to manufacturer's instructions."],"materials":["2 cups all-purpose flour","2 tablespoons white sugar","2 teaspoons baking powder","1 teaspoon baking soda","1/2 teaspoon salt","2 cups low-fat buttermilk","1/3 cup melted butter","2 large eggs, lightly beaten","1 teaspoon vanilla extract"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1c2448a980e0012fab9f9"},"previous_version":"None","title":"Rich Yogurt Waffles","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat a waffle iron according to manufacturers instructions. Beat eggs in a large mixing bowl, then add yogurt, flour, baking powder, baking soda, kosher salt, and shortening, mixing until smooth.","Pour batter onto hot waffle iron. Cook until no longer steaming, about 5 minutes."],"materials":["3 eggs","1 1/2 cups vanilla fat-free yogurt","1 1/4 cups all-purpose flour","2 teaspoons baking powder","1 teaspoon baking soda","1/2 teaspoon kosher salt","1/2 cup shortening"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1c2c28a980e0012fab9fa"},"previous_version":"None","title":"Whole Grain Waffles","created_at":1.521569197158e+12,"version":1,"instructions":["In a large bowl, whisk together the eggs, milk, oil, applesauce, and vanilla. Beat in whole wheat pastry flour, flax seed meal, wheat germ, all-purpose flour, baking powder, sugar, and salt until batter is smooth.","Preheat a waffle iron, and coat with cooking spray. Pour batter into waffle iron in batches, and cook until crisp and golden brown."],"materials":["2 eggs, beaten","1 3/4 cups skim milk","1/4 cup canola oil","1/4 cup unsweetened applesauce","1 teaspoon vanilla extract","1 cup whole wheat pastry flour","1/2 cup flax seed meal","1/4 cup wheat germ","1/4 cup all-purpose flour","4 teaspoons baking powder","1 tablespoon sugar","1/4 teaspoon salt"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1c3668a980e0012fab9fb"},"previous_version":"None","title":"Potato Waffles","created_at":1.521569197158e+12,"version":1,"instructions":["Melt butter in a skillet over medium heat.","Cook and stir onion and garlic in the melted butter until onion is tender, 5 to 7 minutes.","Preheat a waffle iron according to manufacturer's instructions.","Combine onion mixture, mashed potatoes, flour, eggs, salt, and black pepper in a large bowl until well blended.","Scoop 1/4 to 1/2 cup batter (depending on size of waffle iron) into the center of waffle iron and close lid. Cook until golden brown, 3 to 5 minutes."],"materials":["2 tablespoons butter","1 onion, chopped","1 tablespoon minced garlic","2 cups mashed potatoes","1/4 cup all-purpose flour","2 eggs","1/4 teaspoon salt","1/4 teaspoon ground black pepper"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1c3df8a980e0012fab9fc"},"previous_version":"None","title":"Whole Wheat Oat Waffles","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat a waffle maker according to manufacturers directions.","Whisk whole wheat flour, all-purpose flour, oat flour, sugar, baking powder, and salt together in a bowl. Whisk egg yolks, milk, canola oil, and vanilla extract in a separate bowl. Beat egg whites in a third bowl (not plastic) with an electric mixer until soft peaks form when you lift the beaters straight out of the beaten eggs, 1 to 2 minutes.","Make a well in the dry ingredients and pour the milk mixture into the well; mix batter until smooth. Gently fold the egg whites into the batter, retaining as much volume as possible. Let batter stand until slightly thickened, about 5 minutes.","Pour 1/2 cup of batter, or amount recommended by the manufacturer, onto the waffle maker; close lid and bake waffle until browned and crisp, 2 to 4 minutes."],"materials":["1/2 cup whole wheat pastry flour","1/2 cup all-purpose flour","1 cup oat flour","1/4 cup white sugar","1 tablespoon baking powder","1/2 teaspoon salt","2 eggs, separated","1 1/2 cups milk","2 tablespoons canola oil","1 teaspoon vanilla extract"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1c4648a980e0012fab9fd"},"previous_version":"None","title":"Chocolate Waffles I","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat waffle iron. In a large mixing bowl, stir together flour, baking powder, salt, sugar and cocoa. Stir in milk, eggs and butter until mixture is smooth.","To make hard sauce: stir together softened butter, confectioner's sugar, vanilla extract and milk. Sauce should be fairly stiff.","Spray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown. Serve hot with hard sauce."],"materials":["1 1/2 cups all-purpose flour","3 teaspoons baking powder","1/2 teaspoon salt","1/2 cup white sugar","3 tablespoons unsweetened cocoa powder","1 cup milk","2 eggs","4 tablespoons butter, melted","1 tablespoon butter, softened","3/4 cup confectioner's sugar","1/2 teaspoon vanilla extract","1 teaspoon milk"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1c5278a980e0012fab9fe"},"previous_version":"None","title":"Chef John's Banana Bread","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat the oven to 325 degrees F (165 degrees C). Coat a 9x4-inch loaf pan with cooking spray.","Whisk flour, salt, baking powder, and baking soda together in a bowl.","Beat butter and sugar with an electric mixer in a large bowl until smooth. Add mashed bananas and beat until combined. Beat eggs into the butter mixture one at a time, fully blending each egg before adding the next. Stir vanilla extract and milk into the mixture.","Stir chopped walnuts, chocolate chips, and flour mixture into banana mixture until just incorporated.","Pour batter into the prepared loaf pan. Tap pan on the counter to release any air pockets.","Bake in preheated oven for about 1 hour 10 minutes, or until an inserted toothpick comes out clean. 7. Let the bread rest in the pan for 15-20 minutes; remove from pan, slice, and serve."],"materials":["cooking spray","2 cups all-purpose flour","1 teaspoon salt","1 teaspoon baking powder","1 teaspoon baking soda","1/2 cup butter, softened","3 ripe bananas, mashed","1 cup white sugar","2 large eggs","1/4 teaspoon vanilla extract","1 tablespoon milk","1 cup chopped walnuts","1/3 cup semisweet chocolate chips"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1c5b78a980e0012fab9ff"},"previous_version":"None","title":"Banana-Zucchini Bread","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 325 degrees F (165 degrees C). Grease and flour two 8x4 inch bread loaf pans.","In a large bowl, beat eggs until light yellow and frothy. Add oil, brown sugar, white sugar, grated zucchini, bananas, and vanilla; blend together until well combined. Stir in the flour, cinnamon, baking powder, baking soda, and salt. Mix in the cranberries and nuts. Divide the batter evenly between the two prepared loaf pans.","Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 50 minutes. Allow to cool in the loaf pans on a wire rack before removing and serving."],"materials":["3 eggs","3/4 cup vegetable oil","2/3 cup packed brown sugar","1 cup white sugar","1 cup grated zucchini","2 bananas, mashed","2 teaspoons vanilla extract","3 1/2 cups all-purpose flour","1 tablespoon ground cinnamon","1 1/2 teaspoons baking powder","1 teaspoon baking soda","1 teaspoon salt","1/2 cup dried cranberries","1/2 cup chopped walnuts"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1c61b8a980e0012faba00"},"previous_version":"None","title":"Easy Cloud Bread","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.","Beat egg whites and cream of tartar together in a bowl until stiff peaks form.","Mix egg yolks, cream cheese, and sugar together in a separate bowl using a wooden spoon and then mixing with a hand-held egg beater until mixture is very smooth and has no visible cream cheese. Gently fold egg whites into cream cheese mixture, taking care not to deflate the egg whites.","Carefully scoop mixture onto the prepared baking sheet, forming 5 to 6 buns.","Bake in the preheated oven until cloud bread is lightly browned, about 30 minutes."],"materials":["3 large eggs, separated","1/4 teaspoon cream of tartar","2 ounces cream cheese, very soft","1 tablespoon white sugar"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1c6908a980e0012faba01"},"previous_version":"None","title":"Grandma McAndrews' Irish Soda Bread","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet, or line with parchment paper.","In a large bowl, stir together the flour, sugar, baking soda, baking powder, and salt. In another bowl, whisk together eggs, buttermilk, and corn oil. Make a well in the center of the flour mixture, and pour in the buttermilk mixture. Add the raisins, and stir a few times, just until the ingredients come together into a soft dough. Turn the dough out onto a floured surface, and with floured hands shape dough into a ball. Place the dough on the prepared baking sheet, and cut a large cross in the top with a sharp knife.","Place the bread on a middle rack of the preheated oven, and bake until golden brown, 30 to 40 minutes."],"materials":["4 cups all-purpose flour","1/4 cup white sugar","1 teaspoon baking soda","2 teaspoons baking powder","1 teaspoon salt","2 eggs","1 1/4 cups buttermilk","1/4 cup corn oil","1 cup raisins"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab1c7048a980e0012faba02"},"previous_version":"None","title":"Apple Breakfast Bread","created_at":1.521569197158e+12,"version":1,"instructions":[" Preheat oven to 350 degrees F (175 degrees C). Lightly grease an 8x4 inch loaf pan.","In a bowl, mix the butter and sugar until smooth and creamy. Beat in the eggs.","In a separate bowl, sift together the flour, baking soda, salt, cinnamon, and cloves. Mix into the butter mixture until moistened. Fold in the apples. Transfer to the prepared loaf pan.","Bake 1 hour in the preheated oven, until a toothpick inserted in the center comes out clean. Cool in the pan for 15 minutes before removing to a wire rack to cool completely."],"materials":["1/2 cup butter","1 cup sugar","2 eggs","2 cups all-purpose flour","1 teaspoon baking soda","1/2 teaspoon salt","1 teaspoon ground cinnamon","1/2 teaspoon ground cloves","2 apples - peeled, cored and chopped"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab278158a980e0012faba03"},"previous_version":"None","title":"Irresistible Irish Soda Bread","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5 inch loaf pan.","Combine flour, baking powder, sugar, salt and baking soda. Blend egg and buttermilk together, and add all at once to the flour mixture. Mix just until moistened. Stir in butter. Pour into prepared pan.","Bake for 65 to 70 minutes, or until a toothpick inserted in the bread comes out clean. Cool on a wire rack. Wrap in foil for several hours, or overnight, for best flavor."],"materials":["3 cups all-purpose flour","1 tablespoon baking powder","1/3 cup white sugar","1 teaspoon salt","1 teaspoon baking soda","1 egg, lightly beaten","2 cups buttermilk","1/4 cup butter, melted"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab278858a980e0012faba04"},"previous_version":"None","title":"Joy's Easy Banana Bread","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan.","Combine bananas, sugar, egg, and butter together in a bowl. Mix flour and baking soda together in a separate bowl; stir into banana mixture until batter is just mixed. Stir salt into batter. Pour batter into the prepared loaf pan.","Bake in the preheated oven until a toothpick inserted in the center of the bread comes out clean, about 1 hour."],"materials":["3 ripe bananas, mashed","1 cup white sugar","1 egg 1/4 cup melted butter","1 1/2 cups all-purpose flour","1 teaspoon baking soda","1 teaspoon salt"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab278f28a980e0012faba05"},"previous_version":"None","title":"Grandma's English Muffin Bread","created_at":1.521569197158e+12,"version":1,"instructions":[" Place ingredients in the bread machine pan in the order suggested by the manufacturer. Select the dough cycle.","Divide dough into two unequal parts, and shape into loaves. Place in one 9 x 5 inch loaf pan and one 7 x 3 inch loaf pan; non-stick pans are preferable, but greased and floured normal pans will suffice. Cover, and allow to raise until doubled in size.","Bake at 400 degrees F (205 degrees C) for about 15 minutes. Grandma bakes hers longer for a more browned and chewier crust."],"materials":["3 cups all-purpose flour","2 1/4 teaspoons active dry yeast","1/2 tablespoon white sugar","1 teaspoon salt","1/8 teaspoon baking powder","1 cup warm milk","1/4 cup water"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab279738a980e0012faba06"},"previous_version":"None","title":"Breakfast Bread","created_at":1.521569197158e+12,"version":1,"instructions":["Heat the milk in a small saucepan until it bubbles, then remove from heat. Add the butter, salt and sugar and stir until melted; let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.","In a large bowl, combine milk mixture with the yeast mixture. Mix in the egg and 3 cups of flour. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.","Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until dough reaches the pan tops, about 30 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).","Bake in preheated oven for 45 to 50 minutes, or until bottom of the loaves sound hollow when tapped. Place on wire racks to cool."],"materials":["2 cups milk","1/2 cup unsalted butter","1 teaspoon salt","2 tablespoons white sugar","2 (.25 ounce) packages active dry yeast","2/3 cup warm water (110 degrees F/45 degrees C)","1 egg, beaten","7 cups all-purpose flour"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab27a1a8a980e0012faba07"},"previous_version":"None","title":"Cinnamon Bread I","created_at":1.521569197158e+12,"version":1,"instructions":["reheat oven to 350 degrees F (175 degrees C). Grease one 9x5 inch loaf pan.","Measure flour, 1 cup sugar, baking powder, baking soda, 1 1/2 teaspoons cinnamon, salt, buttermilk, oil, eggs and vanilla into large mixing bowl. Beat 3 minutes. Pour into prepared loaf pan. Smooth top.","Combine 2 tablespoons white sugar, 1 teaspoon cinnamon and butter, mixing until crumbly. Sprinkle topping over smoothed batter. Using knife, cut in a light swirling motion to give a marbled effect.","Bake for about 50 minutes. Test with toothpick. When inserted it should come out clean. Remove bread from pan to rack to cool."],"materials":["2 cups all-purpose flour","1 cup white sugar","2 teaspoons baking powder","1/2 teaspoon baking soda","1 1/2 teaspoons ground cinnamon","1 teaspoon salt","1 cup buttermilk","1/4 cup vegetable oil","2 eggs","2 teaspoons vanilla extract","2 tablespoons white sugar","1 teaspoon ground cinnamon","2 teaspoons margarine"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab27ad08a980e0012faba08"},"previous_version":"None","title":"Downeast Maine Pumpkin Bread","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7x3 inch loaf pans.","In a large bowl, mix together pumpkin puree, eggs, oil, water and sugar until well blended. In a separate bowl, whisk together the flour, baking soda, salt, cinnamon, nutmeg, cloves and ginger. Stir the dry ingredients into the pumpkin mixture until just blended. Pour into the prepared pans.","Bake for about 50 minutes in the preheated oven. Loaves are done when toothpick inserted in center comes out clean."],"materials":["1 (15 ounce) can pumpkin puree","4 eggs","1 cup vegetable oil","2/3 cup water","3 cups white sugar","3 1/2 cups all-purpose flour","2 teaspoons baking soda","1 1/2 teaspoons salt","1 teaspoon ground cinnamon","1 teaspoon ground nutmeg","1/2 teaspoon ground cloves","1/4 teaspoon ground ginger"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab27b848a980e0012faba09"},"previous_version":"None","title":"Monkey Bread I","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Grease one 9 or 10 inch tube/Bundt(R) pan.","Mix white sugar and cinnamon in a plastic bag. Cut biscuits into quarters. Shake 6 to 8 biscuit pieces in the sugar cinnamon mix. Arrange pieces in the bottom of the prepared pan. Continue until all biscuits are coated and placed in pan. If using nuts and raisins, arrange them in and among the biscuit pieces as you go along.","In a small saucepan, melt the margarine with the brown sugar over medium heat. Boil for 1 minute. Pour over the biscuits.","Bake at 350 degrees F (175 degrees C) for 35 minutes. Let bread cool in pan for 10 minutes, then turn out onto a plate. Do not cut! The bread just pulls apart."],"materials":["3 (12 ounce) packages refrigerated biscuit dough","1 cup white sugar","2 teaspoons ground cinnamon","1/2 cup margarine","1 cup packed brown sugar","1/2 cup chopped walnuts (optional)","1/2 cup raisins"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2cf748a980e0012faba0a"},"previous_version":"None","title":"Slow-Cooker Corned Beef and Cabbage","created_at":1.521569197158e+12,"version":1,"instructions":["Place the carrots, potatoes, and onion into the bottom of a slow cooker, pour in the water, and place the brisket on top of the vegetables. Pour the beer over the brisket. Sprinkle on the spices from the packet, cover, and set the cooker on High.","Cook the brisket for about 8 hours. An hour before serving, stir in the cabbage and cook for 1 more hour."],"materials":["4 large carrots, peeled and cut into matchstick pieces","10 baby red potatoes, quartered","1 onion, peeled and cut into bite-sized pieces","4 cups water","1 (4 pound) corned beef brisket with spice packet","6 ounces beer","1/2 head cabbage, coarsely chopped"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2cfe08a980e0012faba0b"},"previous_version":"None","title":"Braised Corned Beef Brisket","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 275 degrees F (135 degrees C).","Discard any flavoring packet from corned beef. Brush brisket with browning sauce on both sides. Heat vegetable oil in a large skillet over medium-high heat and brown brisket on both sides in the hot oil, 5 to 8 minutes per side.","Place brisket on a rack set in a roasting pan. Scatter onion and garlic slices over brisket and add water to roasting pan. Cover pan tightly with aluminum foil.","Roast in the preheated oven until meat is tender, about 6 hours."],"materials":[" 1 (5 pound) flat-cut corned beef brisket ","1 tablespoon browning sauce (such as Kitchen Bouquet), or as desired"," 1 tablespoon vegetable oil "," 1 onion, sliced ","6 cloves garlic, sliced","2 tablespoons water"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d09b8a980e0012faba0c"},"previous_version":"None","title":"Chicken Parmesan","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat an oven to 450 degrees F (230 degrees C).","Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Season chicken thoroughly with salt and pepper.","Beat eggs in a shallow bowl and set aside.","Mix bread crumbs and 1/2 cup Parmesan cheese in a separate bowl, set aside.","Place flour in a sifter or strainer; sprinkle over chicken breasts, evenly coating both sides.","Dip flour coated chicken breast in beaten eggs. Transfer breast to breadcrumb mixture, pressing the crumbs into both sides. Repeat for each breast. Set aside breaded chicken breasts for about 15 minutes.","Heat 1 cup olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken until golden, about 2 minutes on each side. The chicken will finish cooking in the oven.","Place chicken in a baking dish and top each breast with about 1/3 cup of tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle 1 to 2 tablespoons of Parmesan cheese on top and drizzle with 1 tablespoon olive oil.","Bake in the preheated oven until cheese is browned and bubbly, and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."],"materials":["4 skinless, boneless chicken breast halves","salt and freshly ground black pepper to taste"," 2 eggs ","1 cup panko bread crumbs, or more as needed","1/2 cup grated Parmesan cheese","2 tablespoons all-purpose flour, or more if needed"," 1 cup olive oil for frying ","1/2 cup prepared tomato sauce","1/4 cup fresh mozzarella, cut into small cubes","1/4 cup chopped fresh basil","1/2 cup grated provolone cheese"," 1/4 cup grated Parmesan cheese ","1 tablespoon olive oil"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d15f8a980e0012faba0d"},"previous_version":"None","title":"Buffalo Shrimp","created_at":1.521569197158e+12,"version":1,"instructions":["In a large resealable plastic bag, combine the flour, Creole-style seasoning, garlic powder, ground cayenne pepper, onion powder, and ground black pepper. Seal the bag and shake a few times to combine the ingredients well.","Rinse the shrimp under cold water and place them in the plastic bag with the flour mixture. Seal the bag and shake to coat all of the shrimp well with the flour mixture.","Place the coated shrimp on a cookie sheet and place in the refrigerator for 15 to 20 minutes. Save remaining flour mixture in the bag.","In a mixing bowl, whisk together garlic, butter hot sauce and cayenne pepper; set aside. In a pot, heat the oil to 375 degrees F (190 degrees C).","Remove shrimp from refrigerator and shake a second time in flour mixture.","Place the shrimp in hot oil and fry until pink, about 2 to 3 minutes. Immediately coat with buffalo sauce."],"materials":["2 cups all-purpose flour"," 2 tablespoons Creole-style seasoning ","1 tablespoon garlic powder","1 tablespoon ground cayenne pepper","1 teaspoon onion powder","1 teaspoon freshly ground black pepper","1 pound large shrimp, peeled and deveined with tails attached","4 cups oil for frying","4 cloves garlic, minced","2 1/2 tablespoons butter","6 ounces hot pepper sauce","1 teaspoon ground cayenne pepper"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d3208a980e0012faba0e"},"previous_version":"None","title":"Asian Beef with Snow Peas","created_at":1.521569197158e+12,"version":1,"instructions":["In a small bowl, combine the soy sauce, rice wine, brown sugar and cornstarch. Set aside.","Heat oil in a wok or skillet over medium high heat. Stir-fry ginger and garlic for 30 seconds. Add the steak and stir-fry for 2 minutes or until evenly browned. Add the snow peas and stir-fry for an additional 3 minutes. Add the soy sauce mixture, bring to a boil, stirring constantly. Lower heat and simmer until the sauce is thick and smooth. Serve immediately."],"materials":[" 3 tablespoons soy sauce ","2 tablespoons rice wine","1 tablespoon brown sugar","1/2 teaspoon cornstarch","1 tablespoon vegetable oil","1 tablespoon minced fresh ginger root","1 tablespoon minced garlic","1 pound beef round steak, cut into thin strips","8 ounces snow peas"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d3918a980e0012faba0f"},"previous_version":"None","title":"Pasta Pomodoro","created_at":1.521569197158e+12,"version":1,"instructions":["Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 minutes or until al dente; drain.","Pour olive oil in a large deep skillet over high-heat. Saute onions and garlic until lightly browned. Reduce heat to medium-high and add tomatoes, vinegar and chicken broth; simmer for about 8 minutes.","Stir in red pepper, black pepper, basil and cooked pasta, tossing thoroughly with sauce. Simmer for about 5 more minutes and serve topped with grated cheese."],"materials":["1 (16 ounce) package angel hair pasta","1/4 cup olive oil","1/2 onion, chopped","4 cloves garlic, minced","2 cups roma (plum) tomatoes, diced","2 tablespoons balsamic vinegar","1 (10.75 ounce) can low-sodium chicken broth","crushed red pepper to taste","freshly ground black pepper to taste","2 tablespoons chopped fresh basil","1/4 cup grated Parmesan cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d40d8a980e0012faba10"},"previous_version":"None","title":"Fry Bread Tacos II","created_at":1.521569197158e+12,"version":1,"instructions":["Combine beans and 2 tablespoons of picante sauce in a small saucepan over low heat. Cook until heated through, about 5 minutes.","Combine ground beef and taco seasoning mix in a large skillet over medium-high heat; cook until browned, 5 to 8 minutes. Cover, and keep warm while you prepare the fry bread.","In a medium bowl, stir together the flour, baking powder, and salt. Stir in milk and mix until the dough comes together. Add more flour if necessary to be able to handle the dough.","On a floured surface, knead the dough until smooth, at least 5 minutes. Let the dough rest for 5 minutes. Break off 3/4 cup sized pieces of dough, and shape into round discs 1/4 inch in thickness, making a thinner depressed area in the center.","Heat 1 1/2 inches oil in a large, deep heavy skillet to 365 degrees F (180 degrees C). Fry dough in the hot oil until golden on both sides, about 3 minutes per side. Drain on paper towels.","Top fry bread with beans, ground beef, lettuce, and Cheddar cheese. Spoon picante sauce on top."],"materials":["1 (15.5 ounce) can pinto beans, with liquid","1/2 cup picante sauce, divided","1 pound ground beef","1 (1.25 ounce) package taco seasoning mix","2 cups all-purpose flour, or more as needed","1 tablespoon baking powder"," 1 teaspoon salt ","1 cup milk","oil for frying","2 cups shredded iceberg lettuce","1 cup shredded Cheddar cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d47b8a980e0012faba11"},"previous_version":"None","title":"Easy Meatloaf","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C).","In a large bowl, combine the beef, egg, onion, milk and bread OR cracker crumbs. Season with salt and pepper to taste and place in a lightly greased 5x9 inch loaf pan, OR form into a loaf and place in a lightly greased 9x13 inch baking dish.","In a separate small bowl, combine the brown sugar, mustard and ketchup. Mix well and pour over the meatloaf.","Bake at 350 degrees F (175 degrees C) for 1 hour."],"materials":["1 1/2 pounds ground beef","1 egg","1 onion, chopped","1 cup milk","1 cup dried bread crumbs","salt and pepper to taste","2 tablespoons brown sugar","2 tablespoons prepared mustard","1/3 cup ketchup"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d5cb8a980e0012faba12"},"previous_version":"None","title":"Simple Baked Chicken Breasts","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat convection oven to 400 degrees F (200 degrees C).","Rub chicken breasts with olive oil and sprinkle both sides with salt and Creole seasoning. Place chicken in a broiler pan.","Bake in the preheated oven for 10 minutes. Flip chicken and cook until no longer pink in the center and the juices run clear, about 15 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).","Remove chicken from pan. Pour water into the pan, while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add more water if needed to dislodge the browned bits; serve alongside chicken."],"materials":["4 skinless, boneless chicken breast halves"," 2 tablespoons olive oil ","1 tablespoon coarse sea salt","1 pinch Creole seasoning (such as Tony Chachere's), or to taste","1 tablespoon water, or as needed"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d6578a980e0012faba13"},"previous_version":"None","title":"Pork Marsala","created_at":1.521569197158e+12,"version":1,"instructions":["Mix flour, salt ,garlic salt, garlic powder, and oregano together in a medium bowl. Add pork chops, and toss until well coated.","Heat butter and olive oil in a large skillet over medium heat. Place pork in skillet in a single layer, and cook, turning occasionally, until brown on both sides. Add mushrooms and minced garlic; cook and stir briefly.","Stir in wine, scraping the skillet to loosen any brown bits. Cover and simmer over medium heat until pork is tender and sauce is thickened, about 15 minutes. If sauce is too thick, adjust by stirring in a small amount of wine."],"materials":["1/3 cup all-purpose flour","1/4 teaspoon salt","1/4 teaspoon garlic salt","3/4 teaspoon garlic powder","1/2 teaspoon dried oregano","1 pound boneless pork loin chops, pounded thin","3 tablespoons butter","1/4 cup olive oil","2 cups sliced fresh mushrooms"," 1 teaspoon minced garlic ","1 cup Marsala wine"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d6958a980e0012faba14"},"previous_version":"None","title":"Grilled Chicken with Rosemary and Bacon","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat an outdoor grill for medium-high heat, and lightly oil the grate.","Sprinkle 1 teaspoon garlic powder on a chicken breast and season with salt and pepper. Lay one rosemary sprig on the chicken breast. Wrap the bacon around the chicken to hold the rosemary on. Secure the bacon with a toothpick or an additional thick rosemary stem.","Cook the chicken breasts until no longer pink in the center and the juices run clear, 8 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Stay near the grill to combat any flare ups from the bacon. Remove the toothpicks before serving."],"materials":["4 teaspoons garlic powder","4 skinless, boneless chicken breast halves","salt and pepper to taste","4 sprigs fresh rosemary","4 thick slices bacon"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d74f8a980e0012faba15"},"previous_version":"None","title":"Beefy Baked Ravioli","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat the oven to 450 degrees F (230 degrees C).","Crumble the ground beef into a large skillet over medium-high heat. Cook and stir until no longer pink. Drain grease, then stir in the spaghetti sauce and tomatoes.","Spread 1/3 of the sauce in the bottom of an 11x7 inch baking dish. Arrange 1/2 of the ravioli over the sauce. Sprinkle 1/2 of the mozzarella cheese and 1/2 of the Monterey Jack cheese over the ravioli. Repeat layers, ending with the last of the sauce on top. Cover with aluminum foil.","Bake for 30 minutes in the preheated oven. Sprinkle Parmesan cheese over the top before serving."],"materials":["1 pound ground beef","1/2 (25 ounce) package frozen cheese ravioli"," 1 (14 ounce) jar spaghetti sauce ","1 (14.5 ounce) can diced tomatoes, drained","1 cup shredded mozzarella cheese","1 cup shredded Monterey Jack cheese","1 tablespoon grated Parmesan cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d7c38a980e0012faba16"},"previous_version":"None","title":"Fresh Tomato Shrimp Pasta","created_at":1.521569197158e+12,"version":1,"instructions":["Bring a large pot of lightly salted water to a boil. Add the pasta, and cook for 8 minutes, or until tender. Drain.","In the container of a food processor, combine the garlic, onion and oregano. Pulse until finely chopped. Heat the olive oil in a large skillet over medium heat. Add the onion mixture; cook and stir until fragrant and almost golden. Mix in the tomatoes, basil, salt and pepper. Simmer for about 5 minutes while the pasta is cooking, stirring occasionally.","Mix in spinach until it wilts, then just before the pasta is done, stir in the shrimp. Cook until heated through. Toss with pasta in a large serving bowl, and mix in mozzarella cheese."],"materials":["8 ounces dry fettuccine pasta","3 cloves garlic","1/2 sweet onion, cut into wedges","3 tablespoons fresh oregano leaves","4 tablespoons olive oil","4 medium tomatoes, chopped","3 tablespoons chopped fresh basil","salt and pepper to taste"," 1 cup spinach leaves ","1 pound cooked shrimp - peeled and deveined","8 ounces fresh mozzarella cheese, diced"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d8128a980e0012faba17"},"previous_version":"None","title":"Lemon Rosemary Salmon","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 400 degrees F (200 degrees C).","Arrange half the lemon slices in a single layer in a baking dish. Layer with 2 sprigs rosemary, and top with salmon fillets. Sprinkle salmon with salt, layer with remaining rosemary sprigs, and top with remaining lemon slices. Drizzle with olive oil.","Bake 20 minutes in the preheated oven, or until fish is easily flaked with a fork."],"materials":["1 lemon, thinly sliced","4 sprigs fresh rosemary"," 2 salmon fillets, bones and skin removed "," coarse salt to taste ","1 tablespoon olive oil, or as needed"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d8818a980e0012faba18"},"previous_version":"None","title":"Awesome Slow Cooker Pot Roast","created_at":1.521569197158e+12,"version":1,"instructions":["In a slow cooker, mix cream of mushroom soup, dry onion soup mix and water. Place pot roast in slow cooker and coat with soup mixture.","Cook on High setting for 3 to 4 hours, or on Low setting for 8 to 9 hours."],"materials":["2 (10.75 ounce) cans condensed cream of mushroom soup","1 (1 ounce) package dry onion soup mix","1 1/4 cups water","5 1/2 pounds pot roast"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d90d8a980e0012faba19"},"previous_version":"None","title":"Broiled Tilapia Parmesan","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat your oven's broiler. Grease a broiling pan or line pan with aluminum foil.","In a small bowl, mix together the Parmesan cheese, butter, mayonnaise and lemon juice. Season with dried basil, pepper, onion powder and celery salt. Mix well and set aside.","Arrange fillets in a single layer on the prepared pan. Broil a few inches from the heat for 2 to 3 minutes. Flip the fillets over and broil for a couple more minutes. Remove the fillets from the oven and cover them with the Parmesan cheese mixture on the top side. Broil for 2 more minutes or until the topping is browned and fish flakes easily with a fork. Be careful not to over cook the fish."],"materials":["1/2 cup Parmesan cheese","1/4 cup butter, softened","3 tablespoons mayonnaise","2 tablespoons fresh lemon juice","1/4 teaspoon dried basil"," 1/4 teaspoon ground black pepper ","1/8 teaspoon onion powder","1/8 teaspoon celery salt","2 pounds tilapia fillets"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2d97b8a980e0012faba1a"},"previous_version":"None","title":"Baked Ziti I","created_at":1.521569197158e+12,"version":1,"instructions":["Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook until al dente, about 8 minutes; drain.","In a large skillet, brown onion and ground beef over medium heat. Add spaghetti sauce, and simmer 15 minutes.","Preheat the oven to 350 degrees F (175 degrees C). Butter a 9x13 inch baking dish. Layer as follows: 1/2 of the ziti, Provolone cheese, sour cream, 1/2 sauce mixture, remaining ziti, mozzarella cheese and remaining sauce mixture. Top with grated Parmesan cheese.","Bake for 30 minutes in the preheated oven, or until cheeses are melted."],"materials":["1 pound dry ziti pasta"," 1 onion, chopped ","1 pound lean ground beef","2 (26 ounce) jars spaghetti sauce","6 ounces provolone cheese, sliced","1 1/2 cups sour cream","6 ounces mozzarella cheese, shredded","2 tablespoons grated Parmesan cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2da058a980e0012faba1b"},"previous_version":"None","title":"Brown Sugar Meatloaf","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 5x9 inch loaf pan.","Press the brown sugar in the bottom of the prepared loaf pan and spread the ketchup over the sugar.","In a mixing bowl, mix thoroughly all remaining ingredients and shape into a loaf. Place on top of the ketchup.","Bake in preheated oven for 1 hour or until juices are clear."],"materials":["1/2 cup packed brown sugar","1/2 cup ketchup","1 1/2 pounds lean ground beef","3/4 cup milk","2 eggs","1 1/2 teaspoons salt","1/4 teaspoon ground black pepper","1 small onion, chopped","1/4 teaspoon ground ginger","3/4 cup finely crushed saltine cracker crumbs"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2da718a980e0012faba1c"},"previous_version":"None","title":"Sloppy Joes II","created_at":1.521569197158e+12,"version":1,"instructions":["In a medium skillet over medium heat, brown the ground beef, onion, and green pepper; drain off liquids.","Stir in the garlic powder, mustard, ketchup, and brown sugar; mix thoroughly. Reduce heat, and simmer for 30 minutes. Season with salt and pepper."],"materials":["1 pound lean ground beef","1/4 cup chopped onion","1/4 cup chopped green bell pepper","1/2 teaspoon garlic powder","1 teaspoon prepared yellow mustard","3/4 cup ketchup","3 teaspoons brown sugar","salt to taste","ground black pepper to taste"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2dad68a980e0012faba1d"},"previous_version":"None","title":"Baked Teriyaki Chicken","created_at":1.521569197158e+12,"version":1,"instructions":["In a small saucepan over low heat, combine the cornstarch, cold water, sugar, soy sauce, vinegar, garlic, ginger and ground black pepper. Let simmer, stirring frequently, until sauce thickens and bubbles.","Preheat oven to 425 degrees F (220 degrees C).","Place chicken pieces in a lightly greased 9x13 inch baking dish. Brush chicken with the sauce. Turn pieces over, and brush again.","Bake in the preheated oven for 30 minutes. Turn pieces over, and bake for another 30 minutes, until no longer pink and juices run clear. Brush with sauce every 10 minutes during cooking."],"materials":["1 tablespoon cornstarch","1 tablespoon cold water","1/2 cup white sugar","1/2 cup soy sauce","1/4 cup cider vinegar","1 clove garlic, minced","1/2 teaspoon ground ginger","1/4 teaspoon ground black pepper","12 skinless chicken thighs"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2db5a8a980e0012faba1e"},"previous_version":"None","title":"Chicken Cordon Bleu II","created_at":1.521569197158e+12,"version":1,"instructions":["Pound chicken breasts if they are too thick. Place a cheese and ham slice on each breast within 1/2 inch of the edges. Fold the edges of the chicken over the filling, and secure with toothpicks. Mix the flour and paprika in a small bowl, and coat the chicken pieces.","Heat the butter in a large skillet over medium-high heat, and cook the chicken until browned on all sides. Add the wine and bouillon. Reduce heat to low, cover, and simmer for 30 minutes, until chicken is no longer pink and juices run clear.","Remove the toothpicks, and transfer the breasts to a warm platter. Blend the cornstarch with the cream in a small bowl, and whisk slowly into the skillet. Cook, stirring until thickened, and pour over the chicken. Serve warm."],"materials":[" 6 skinless, boneless chicken breast halves ","6 slices Swiss cheese","6 slices ham","3 tablespoons all-purpose flour","1 teaspoon paprika","6 tablespoons butter"," 1/2 cup dry white wine ","1 teaspoon chicken bouillon granules","1 tablespoon cornstarch","1 cup heavy whipping cream"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2dc2d8a980e0012faba1f"},"previous_version":"None","title":"Zesty Slow Cooker Chicken Barbecue","created_at":1.521569197158e+12,"version":1,"instructions":["Place chicken in a slow cooker. In a bowl, mix the barbecue sauce, Italian salad dressing, brown sugar, and Worcestershire sauce. Pour over the chicken.","Cover, and cook 3 to 4 hours on High or 6 to 8 hours on Low."],"materials":["6 frozen skinless, boneless chicken breast halves"," 1 (12 ounce) bottle barbeque sauce ","1/2 cup Italian salad dressing","1/4 cup brown sugar","2 tablespoons Worcestershire sauce"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2dca08a980e0012faba20"},"previous_version":"None","title":"Baked Pork Chops I","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C).","Rinse pork chops, pat dry, and season with garlic powder and seasoning salt to taste. Place the beaten eggs in a small bowl. Dredge the pork chops lightly in flour, dip in the egg, and coat liberally with bread crumbs.","Heat the oil in a medium skillet over medium-high heat. Fry the pork chops 5 minutes per side, or until the breading appears well browned. Transfer the chops to a 9x13 inch baking dish, and cover with foil.","Bake in the preheated oven for 1 hour. While baking, combine the cream of mushroom soup, milk and white wine in a medium bowl. After the pork chops have baked for an hour, cover them with the soup mixture. Replace foil, and bake for another 30 minutes."],"materials":["6 pork chops","1 teaspoon garlic powder","1 teaspoon seasoning salt","2 egg, beaten","1/4 cup all-purpose flour","2 cups Italian-style seasoned bread crumbs","4 tablespoons olive oil","1 (10.75 ounce) can condensed cream of mushroom soup","1/2 cup milk","1/3 cup white wine"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2dd018a980e0012faba21"},"previous_version":"None","title":"Grilled Salmon I","created_at":1.521569197158e+12,"version":1,"instructions":["Season salmon fillets with lemon pepper, garlic powder, and salt.","In a small bowl, stir together soy sauce, brown sugar, water, and vegetable oil until sugar is dissolved. Place fish in a large resealable plastic bag with the soy sauce mixture, seal, and turn to coat. Refrigerate for at least 2 hours.","Preheat grill for medium heat.","Lightly oil grill grate. Place salmon on the preheated grill, and discard marinade. Cook salmon for 6 to 8 minutes per side, or until the fish flakes easily with a fork."],"materials":["1 1/2 pounds salmon fillets","lemon pepper to taste","garlic powder to taste","salt to taste","1/3 cup soy sauce","1/3 cup brown sugar","1/3 cup water"," 1/4 cup vegetable oil "],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2dd9b8a980e0012faba22"},"previous_version":"None","title":"Slow Cooker Pulled Pork","created_at":1.521569197158e+12,"version":1,"instructions":["Place the pork tenderloin in a slow cooker; pour the root beer over the meat. Cover and cook on low until well cooked and the pork shreds easily, 6 to 7 hours. Note: the actual length of time may vary according to individual slow cooker. Drain well. Stir in barbecue sauce. Serve over hamburger buns."],"materials":[" 1 (2 pound) pork tenderloin ","1 (12 fluid ounce) can or bottle root beer","1 (18 ounce) bottle your favorite barbecue sauce","8 hamburger buns, split and lightly toasted"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2de148a980e0012faba23"},"previous_version":"None","title":"Rosemary Ranch Chicken Kabobs","created_at":1.521569197158e+12,"version":1,"instructions":["In a medium bowl, stir together the olive oil, ranch dressing, Worcestershire sauce, rosemary, salt, lemon juice, white vinegar, pepper, and sugar. Let stand for 5 minutes. Place chicken in the bowl, and stir to coat with the marinade. Cover and refrigerate for 30 minutes.","Preheat the grill for medium-high heat. Thread chicken onto skewers and discard marinade.","Lightly oil the grill grate. Grill skewers for 8 to 12 minutes, or until the chicken is no longer pink in the center, and the juices run clear."],"materials":[" 1/2 cup olive oil ","1/2 cup ranch dressing","3 tablespoons Worcestershire sauce","1 tablespoon minced fresh rosemary","2 teaspoons salt","1 teaspoon lemon juice","1 teaspoon white vinegar","1/4 teaspoon ground black pepper, or to taste","1 tablespoon white sugar, or to taste (optional)","5 skinless, boneless chicken breast halves - cut into 1 inch cubes"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2de688a980e0012faba24"},"previous_version":"None","title":"Easy Slow Cooker French Dip","created_at":1.521569197158e+12,"version":1,"instructions":["Trim excess fat from the rump roast, and place in a slow cooker. Add the beef broth, onion soup and beer. Cook on Low setting for 7 hours.","Preheat oven to 350 degrees F (175 degrees C).","Split French rolls, and spread with butter. Bake 10 minutes, or until heated through.","Slice the meat on the diagonal, and place on the rolls. Serve the sauce for dipping."],"materials":[" 4 pounds rump roast ","1 (10.5 ounce) can beef broth","1 (10.5 ounce) can condensed French onion soup"," 1 (12 fluid ounce) can or bottle beer ","6 French rolls","2 tablespoons butter"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2deed8a980e0012faba25"},"previous_version":"None","title":"Meatball Nirvana","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat an oven to 400 degrees F (200 degrees C).","Place the beef into a mixing bowl, and season with salt, onion, garlic salt, Italian seasoning, oregano, red pepper flakes, hot pepper sauce, and Worcestershire sauce; mix well. Add the milk, Parmesan cheese, and bread crumbs. Mix until evenly blended, then form into 1 1/2-inch meatballs, and place onto a baking sheet.","Bake in the preheated oven until no longer pink in the center, 20 to 25 minutes."],"materials":["1 pound extra lean ground beef","1/2 teaspoon sea salt","1 small onion, diced","1/2 teaspoon garlic salt","1 1/2 teaspoons Italian seasoning","3/4 teaspoon dried oregano","3/4 teaspoon crushed red pepper flakes","1 dash hot pepper sauce or to taste"," 1 1/2 tablespoons Worcestershire sauce ","1/3 cup skim milk","1/4 cup grated Parmesan cheese","1/2 cup seasoned bread crumbs"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2df5d8a980e0012faba26"},"previous_version":"None","title":"Burrito Pie","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C).","In a large skillet over medium heat, saute the ground beef for 5 minutes. Add the onion and garlic, and saute for 5 more minutes. Drain any excess fat, if desired. Mix in the olives, green chile peppers, tomatoes with green chile peppers, taco sauce and refried beans. Stir mixture thoroughly, reduce heat to low, and let simmer for 15 to 20 minutes.","Spread a thin layer of the meat mixture in the bottom of a 4 quart casserole dish. Cover with a layer of tortillas followed by more meat mixture, then a layer of cheese. Repeat tortilla, meat, cheese pattern until all the tortillas are used, topping off with a layer of meat mixture and cheese.","Bake for 20 to 30 minutes in the preheated oven, or until cheese is slightly brown and bubbly."],"materials":["2 pounds ground beef","1 onion, chopped","2 teaspoons minced garlic","1 (2 ounce) can black olives, sliced","1 (4 ounce) can diced green chili peppers","1 (10 ounce) can diced tomatoes with green chile peppers","1 (16 ounce) jar taco sauce","2 (16 ounce) cans refried beans","12 (8 inch) flour tortillas","9 ounces shredded Colby cheese"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2dfd88a980e0012faba27"},"previous_version":"None","title":"Famous Butter Chicken","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 375 degrees F (190 degrees C).","Place eggs and cracker crumbs in two separate shallow bowls. Mix cracker crumbs with garlic salt and pepper. Dip chicken in the eggs, then dredge in the crumb mixture to coat.","Arrange coated chicken in a 9x13 inch baking dish. Place pieces of butter around the chicken.","Bake in the preheated oven for 40 minutes, or until chicken is no longer pink and juices run clear."],"materials":["2 eggs, beaten","1 cup crushed buttery round cracker crumbs","1/2 teaspoon garlic salt","ground black pepper to taste","4 skinless, boneless chicken breast halves","1/2 cup butter, cut into pieces"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2e0468a980e0012faba28"},"previous_version":"None","title":"Rempel Family Meatloaf","created_at":1.521569197158e+12,"version":1,"instructions":["Preheat oven to 350 degrees F (175 degrees C).","Stir the ground beef, crushed crackers, Cheddar cheese, and onion soup mix in a large bowl until well combined. Whisk the eggs, ketchup, and steak sauce in a separate bowl until smooth. Mix the eggs into the meat until evenly combined, if the mixture seems too dry, add a little water. Press into a 9x5 inch loaf pan.","Bake in preheated oven until the meatloaf reaches 160 degrees F (71 degrees C) and is no longer pink in the center, 45 to 60 minutes."],"materials":[" 1 1/2 pounds lean ground beef ","1/2 cup crushed buttery round crackers","3/4 cup shredded Cheddar cheese","1 (1 ounce) package dry onion soup mix","2 eggs, beaten","1/4 cup ketchup","2 tablespoons steak sauce"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2e0968a980e0012faba29"},"previous_version":"None","title":"Baked Salmon II","created_at":1.521569197158e+12,"version":1,"instructions":["In a medium glass bowl, prepare marinade by mixing garlic, light olive oil, basil, salt, pepper, lemon juice and parsley. Place salmon fillets in a medium glass baking dish, and cover with the marinade. Marinate in the refrigerator about 1 hour, turning occasionally.","Preheat oven to 375 degrees F (190 degrees C).","Place fillets in aluminum foil, cover with marinade, and seal. Place sealed salmon in the glass dish, and bake 35 to 45 minutes, until easily flaked with a fork."],"materials":["2 cloves garlic, minced","6 tablespoons light olive oil","1 teaspoon dried basil"," 1 teaspoon salt ","1 teaspoon ground black pepper","1 tablespoon lemon juice","1 tablespoon fresh parsley, chopped","2 (6 ounce) fillets salmon"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
{"_id":{"$oid":"5ab2e0fb8a980e0012faba2a"},"previous_version":"None","title":"Yummy Honey Chicken Kabobs","created_at":1.521569197158e+12,"version":1,"instructions":["In a large bowl, whisk together oil, honey, soy sauce, and pepper. Before adding chicken, reserve a small amount of marinade to brush onto kabobs while cooking. Place the chicken, garlic, onions and peppers in the bowl, and marinate in the refrigerator at least 2 hours (the longer the better).","Preheat the grill for high heat.","Drain marinade from the chicken and vegetables, and discard marinade. Thread chicken and vegetables alternately onto the skewers.","Lightly oil the grill grate. Place the skewers on the grill. Cook for 12 to 15 minutes, until chicken juices run clear. Turn and brush with reserved marinade frequently."],"materials":["1/4 cup vegetable oil","1/3 cup honey","1/3 cup soy sauce","1/4 teaspoon ground black pepper","8 skinless, boneless chicken breast halves - cut into 1 inch cubes","2 cloves garlic","5 small onions, cut into 2 inch pieces","2 red bell peppers, cut into 2 inch pieces","skewers"],"creator_email":"idiot@sandiwch.com","creator":"Gordon Ramsay","__v":0}
